content/students.org
#+title: Felipe A. Ramírez
#+include: "nav.org"


If you are a student who would like to learn more about my research
areas, please get in touch! You may also be interested in our [[https://mathcs-graduate.wescreates.wesleyan.edu/drp/][Directed
Reading Program]] (DRP).

Here are my current and former students, and the titles of their
theses and projects:

#+begin_comment
| student           | degree                 | thesis/project                                                                                                  |
|-------------------+------------------------+-----------------------------------------------------------------------------------------------------------------|
| Stefan Hesseling  | M.A., 2026 (expected)  | TBD                                                                                                             |
| Gilbert Michaud   | Ph.D., 2027 (expected) | TBD                                                                                                             |
| Stefan Hesseling  | B.A.,2025              | On the Lagrange and Markov spectra                                                                              |
| Nachama Stern     | M.A., 2024             | Quantitative density for random and deterministic processes                                                     |
| Daniel Barrueco   | M.A., 2022             | Ergodic theory, entropy, and times 2 times 3                                                                    |
| Dan Alvey         | Ph.D., 2021            | Approximation on affine subspaces                                                                               |
| Andre P. Oliveira | Ph.D., 2021            | Diophantine approximation with restrictions coming from different places                                        |
| Prayag Chatha     | M.A., 2017             | Close enough: a dynamical approach to the Littlewood Conjecture                                                 |
| Max Ryan          | M.A., 2016             | Continued fractions: a geometric perspective                                                                    |
| Prayag Chatha     | B.A., 2016             | Scrambled cats and normal numbers: an introduction to dynamical systems and their number-theoretic applications |
#+end_comment

#+ATTR_HTML: :reversed t :class publist
1. Stefan Hesseling, /TBD/ \\
   M.A., 2026 (expected)
   
2. Gilbert Michaud, /TBD/ \\
   Ph.D., 2027 (expected)
3. Stefan Hesseling, /On the Lagrange and Markov spectra/ \\
   B.A., 2025
4. Nachama Stern, /Quantitative density for random and deterministic processes/ \\
   M.A., 2024
5. Daniel Barrueco, /Ergodic theory, entropy, and times 2 times 3/ \\
   M.A., 2022
6. Dan Alvey, /Approximation on affine subspaces/ \\
   Ph.D., 2021 
7. Andre P. Oliveira, /Diophantine approximation with restrictions coming from different places/ \\
   Ph.D., 2021 
8. Prayag Chatha, /Close enough: a dynamical approach to the Littlewood Conjecture/ \\
   M.A., 2017
9. Max Ryan, /Continued fractions: a geometric perspective/ \\
   M.A., 2016
10. Prayag Chatha, /Scrambled cats and normal numbers: an introduction
    to dynamical systems and their number-theoretic applications/ \\
    B.A., 2016

