docs/students.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Felipe A. Ramírez</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="simple.css" />
      <link rel="icon" href="/favicon_R.svg">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Felipe A. Ramírez</h1>
<nav class="site-nav">
  <a href="/index.html">about</a>
  <a href="/research.html">research</a>
  <a href="/teaching.html">teaching</a>
  <a href="/students.html">students</a>
  <a href="/cv.html">cv</a>
  <a href="/drp.html">drp</a> 
  <a href="/nednt.html">nednt</a>
</nav>

<script>
document.addEventListener("DOMContentLoaded", function () {
  const current = window.location.pathname.replace(/\/$/, "");
  document.querySelectorAll(".site-nav a").forEach(link => {
    const href = link.getAttribute("href").replace(/\/$/, "");
    if (href === current) {
      link.classList.add("current");
      link.removeAttribute("href"); // disables the link
    }
  });
});
</script>

<script>
document.addEventListener("DOMContentLoaded", function() {
  document.querySelectorAll("table.publist").forEach(function(table) {

    const rows = table.querySelectorAll("tbody tr");
    let n = rows.length;

    rows.forEach(function(row) {
      const cell = row.cells[0];

      const num = document.createElement("span");
      num.className = "pubnum";
      num.textContent = n + ".";

      cell.prepend(num);

      n--;
    });

  });
});
</script>

<script>
document.addEventListener("DOMContentLoaded", function () {
  document.querySelectorAll('a[href$=".pdf"]').forEach(function(link) {
    link.setAttribute("target", "_blank");
    link.setAttribute("rel", "noopener");
  });
});
</script>


<p>
If you are a student who would like to learn more about my research
areas, please get in touch! You may also be interested in our <a target="_blank" rel="noopener noreferrer" href="https://mathcs-graduate.wescreates.wesleyan.edu/drp/">Directed
Reading Program</a> (DRP).
</p>

<p>
Here are my current and former students, and the titles of their
theses and projects:
</p>

<ol reversed="t" class="org-ol publist">
<li>Stefan Hesseling, <i>TBD</i> <br />
M.A., 2026 (expected)</li>

<li>Gilbert Michaud, <i>TBD</i> <br />
Ph.D., 2027 (expected)</li>
<li>Stefan Hesseling, <i>On the Lagrange and Markov spectra</i> <br />
B.A., 2025</li>
<li>Nachama Stern, <i>Quantitative density for random and deterministic processes</i> <br />
M.A., 2024</li>
<li>Daniel Barrueco, <i>Ergodic theory, entropy, and times 2 times 3</i> <br />
M.A., 2022</li>
<li>Dan Alvey, <i>Approximation on affine subspaces</i> <br />
Ph.D., 2021</li>
<li>Andre P. Oliveira, <i>Diophantine approximation with restrictions coming from different places</i> <br />
Ph.D., 2021</li>
<li>Prayag Chatha, <i>Close enough: a dynamical approach to the Littlewood Conjecture</i> <br />
M.A., 2017</li>
<li>Max Ryan, <i>Continued fractions: a geometric perspective</i> <br />
M.A., 2016</li>
<li>Prayag Chatha, <i>Scrambled cats and normal numbers: an introduction
to dynamical systems and their number-theoretic applications</i> <br />
B.A., 2016</li>
</ol>
</div>
</body>
</html>
